Revit 2026 API

# DocumentGetSpaceAtPoint(XYZ) Method

---

Gets a space containing the point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Space GetSpaceAtPoint(
	XYZ point
)
```
```vb
Public Function GetSpaceAtPoint (
	point As XYZ
) As Space
```
```cpp
public:
Space^ GetSpaceAtPoint(
	XYZ^ point
)
```
```fsharp
member GetSpaceAtPoint :
        point : XYZ -> Space
```

#### Parameters

point XYZ
    Point to be checked.

#### Return Value

SpaceThe space containing the point.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the point is . |
| ArgumentException | Thrown when the coordinates of the point are not number or are Double::MaxValue or Double::MinValue. |

Surveys only the spaces from the final phase of the project. The first one found will be returned. If there is no space containing the point, it returns .

#### Reference

Document Class

GetSpaceAtPoint Overload

Autodesk.Revit.DB Namespace